temp1/src/InformationRegisters/НепрочитанныеЗадачи/НепрочитанныеЗадачи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НепрочитанныеЗадачи</name>
  <resources>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Непрочитана</name>
    <comment>для упрощения формирования поля в ДС и условного оформления</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Задача</name>
    <type>
      <types>DocumentRef.Задачи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

temp1/src/InformationRegisters/НепрочитанныеЗадачи/ManagerModule.bsl
Процедура ОтметитьПрочтенной(Задача) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НепрочитанныеЗадачи.Пользователь,
	|	НепрочитанныеЗадачи.Задача
	|ИЗ
	|	РегистрСведений.НепрочитанныеЗадачи КАК НепрочитанныеЗадачи
	|ГДЕ
	|	НепрочитанныеЗадачи.Пользователь = &Пользователь
	|	И НепрочитанныеЗадачи.Задача = &Задача";
	Запрос.УстановитьПараметр("Пользователь", ПользователиКлиентСервер.АвторизованныйПользователь());
	Запрос.УстановитьПараметр("Задача", Задача);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Если Выборка.Следующий() Тогда
		Запись = РегистрыСведений.НепрочитанныеЗадачи.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
		Запись.Удалить();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОтметитьНепрочитанной(МассивИсполнительЗаказчик, Задача) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТекущийПользователь = ПользователиКлиентСервер.АвторизованныйПользователь();
	Для каждого Пользователь Из МассивИсполнительЗаказчик Цикл
		Если Не ЗначениеЗаполнено(Пользователь) ИЛИ 
				Не (ТипЗнч(Пользователь) = Тип("СправочникСсылка.Пользователи") ИЛИ ТипЗнч(Пользователь) = Тип("СправочникСсылка.ВнешниеПользователи")) Тогда
			Продолжить;
		КонецЕсли;
		Если Пользователь <> ТекущийПользователь Тогда
			Запись = РегистрыСведений.НепрочитанныеЗадачи.СоздатьМенеджерЗаписи();
			Запись.Задача = Задача;
			Запись.Пользователь = Пользователь;
			Запись.ДатаИзменения = ТекущаяДата();
			Запись.Непрочитана = Истина;
			Запись.Записать();
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры
